package com.example.loveshayari;

import android.content.Intent;
import android.os.Bundle;
import android.view.Menu;
import android.view.MenuInflater;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ListView;

import androidx.appcompat.app.AppCompatActivity;

import MyAdapter.MyAdapter;

public class MainActivity extends AppCompatActivity {

    ListView listView;
    int imgArr[]={R.drawable.img,R.drawable.img_1,R.drawable.img_2,R.drawable.img_3,R.drawable.img_4,R.drawable.img_5,R.drawable.img_6,R.drawable.img_7,R.drawable.img_8,R.drawable.img_9,R.drawable.img_10,R.drawable.img_11};
    String Name[]={"शुभकामनाएं शायरी","दोस्ती शायरी","मजेदार शायरी","भगवान शायरी","प्रेरणा स्त्रोत शायरी","जीवन शायरी","यादें शायरी","अन्य शायरी","राजनीति शायरी","प्रेम शायरी","दर्द शायरी","शराब शायरी"};
    String Shubhkamana[]={"मत मुस्कुराओ इतना की फूलो को खबर लग जाये,\n" +
            "हम करें आपकी तारीफ और आपको नजर लग जाये\n" +
            "खुदा करे बहुत लम्बी हो आपकी जिंदगी ,\n" +
            "और उस पर भी हमारी उम्र लग जाये…","बीते साल को विदा इस तरह करते है.\n" +
            "जो नहीं किया अब तक वो भी कर गुजरते है.\n" +
            "नया साल आने के खुशिया तो सब मानते है.\n" +
            "एक बार हम इते साल कि जस्न मानते है","हर पल मे खुशी देती है मा,\n" +
            "अपनी ज़िंदगी से जीवन देती है मा,\n" +
            "भगवान क्या है!!! मा की पूजा करो जनाब,\n" +
            "क्यूकी भगवान को भी जनम देती है मा…","बरसात आये तो ज़मीन गीली न हो,\n" +
            "धूप आये तो सरसों पीली न हो,\n" +
            "ए दोस्त तूने यह कैसे सोच लिया कि,\n" +
            "तेरी याद आये और पलकें गीली न हों।","जा SMS जा मेरे sweetheart के पास,\n" +
            "धीरे से जाना शोर न मचाना,\n" +
            "busy हो तो चुप रहना\n" +
            "free हो तो आई मिस यू कहना ..","दिल से निकली हे दुआ हमारी\n" +
            "जिन्दगी में मिले आपको खुशिया\n" +
            "गम न दे खुदा आपको कभी\n" +
            "चाहे तो एक ख़ुशी कम कर ले हमारी","लोग कहते हैं किसी एक के चले जाने से जिन्दगी अधूरी नहीं होती,\n" +
            "लेकिन लाखों के मिल जाने से उस एक की कमी पूरी नहीं होती है","ईश्वर न करे आपको कोई ग़म हो,\n" +
            "\n" +
            "और सिर्फ खुशियाँ और हँसी मिले,\n" +
            "\n" +
            "ग़म जब भी बढ़ चले आपकी ओर,\n" +
            "\n" +
            "ईश्वर करे रास्ते में उसे पहले हम मिले।","जन्मदिन के ये बहुत ख़ास लम्हे मुबारक,\n" +
            "\n" +
            "आँखों में बसे नए नए ख्वाब मुबारक,\n" +
            "\n" +
            "जिंदगी जो लेकर आयी है आपके लिए आज,\n" +
            "\n" +
            "वो तमाम खुशियों की हसी सौगात मुबारक।","ज़िन्दगी की कुछ खास दुआएं लेलो हमसे,\n" +
            "\n" +
            "जन्मदिन पर कुछ नजराने लेलो हमसे,\n" +
            "\n" +
            "भर दे रंग जो तेरे जीवन के पलो में,\n" +
            "\n" +
            "आज वो हँसी मुबारक-बाद लेलो हमसे।"};
    String Dosti[]={"जो आसानी से मिले वो हैं.. धोखा \n" +
            "जो दिल से मिले वो हैं …प्यार \n" +
            "जो मुश्किल से मिले वो हैं …इज्ज़त \n" +
            "मगर\n" +
            " जो नसीब से मिले वो हैं …दोस्त ।","इश्क़ ने दोस्ती से एक दिन पूछ ही लिया … जब में यहां हूँ तो तेरा क्या काम हैं ? \n" +
            "\n" +
            "तो दोस्ती ने मुस्कुराते हुए कहा , जहाँ तू नाकाम हैं , वहां मेरा ही नाम हैं ।","चांद की दोस्ती रात से सुबह तक..!!\n" +
            "\n" +
            "सूरज की दोस्ती सुबह से रात तक..!!\n" +
            "\n" +
            "पर हमारी दोस्ती पहली मुलाकात से, आखरी सांस तक..!!","दोस्त का प्यार दुआ से कम नहीं होता, दोस्त दूर हो तो भी गम नहीं होता, प्यार में अक्सर दोस्ती कम हो जाती है, पर दोस्ती में कभी प्यार कम नहीं होता।","दोस्त का प्यार दुआ से कम नहीं होता, दोस्त दूर हो तो भी गम नहीं होता, प्यार में अक्सर दोस्ती कम हो जाती है, पर दोस्ती में कभी प्यार कम नहीं होता।","न जाने कौन सी दौलत है,\n" +
            "कुछ दोस्तों के लफ्जों में, बात करते है तो दिल ही खरीद लेते हैं ।","दोस्ती मेरी बड़े लोगों के साथ ना सही पर साथ देने वालों के साथ जरूर है ।","यदि कोई आपकी गलती आपके मुंह पर कहने की ताकत रखता है तो आपके लिए उससे अच्छा दोस्त कोई और नहीं हो सकता ।","हर मुश्किलों में साथ देते हैं दोस्त, हर गम को बांट लेते है दोस्त ।\n" +
            "ना रिश्ता खून का ना रिवाज से बंधा फिर भी जिन्दगी भर साथ देते हैं दोस्त ।","दोस्ती का रिश्ता, रिश्तेदारी से बहुत अच्छा होता है, क्योंकि रिश्तेदारों से रिश्ता खून का होता है\n" +
            "और दोस्ती का रिश्ता दिल से होता है और दिल तो वो चीज है जो सारे जिस्म को खून पहुंचाता है ।"};
    String Majedar[]={"ऐ खुदा हिचकियों में कुछ तो फर्क डाला होता,\n" +
            "अब कैसे पता करूँ कि\n" +
            "कौनसी वाली याद कर रही है !","मेरा दिल भी ले गयी मेरा चैन भी ले गयी,\n" +
            "हद हो गयी तब जब मैंने देखा,\n" +
            "वो मेरा पाँच रूपये का पेन भी ले गयी !","ट्यूशन में उसकी सीट पर,\n" +
            "चॉकलेट रख आया था,\n" +
            "अगले दिन वो मेरी सीट पे पैसे रख गयी !","सीखा था Guitar जिसे पटाने के लिए\n" +
            "अब आर्डर आया है,\n" +
            "उसी की शादी में बजाने के लिए !","जब तिरछी नजरों से उन्होंने हमको देखा,\n" +
            "तो हम मदहोश हो गए\n" +
            "जब पता लगा उनकी नजरें ही तिरछी हैं,\n" +
            "तो हम बेहोश हो गए !","हम तो निकले थे तलाश-से-इश्क में,\n" +
            "अपनी तनहाईयों से लड़ कर,\n" +
            "मगर गर्मी बहुत थी बियर पी के वापिस आ गए !","किस किस का नाम लें अपनी बरबादी में,\n" +
            "बहुत लोग आये थे दुआएं देने शादी में !","गाली देने से इतनी लड़ाई नहीं होती,\n" +
            "जितना Last seen देखकर होती है !","यारो मेरे मरने के बाद आँसू मत बहाना,\n" +
            "ज्यादा याद आए तो उपर ही चले आना !","किसी से दिल लगाने से अच्छा है,\n" +
            "घर में झाडू पोछा लगा लो,\n" +
            "कम से कम मम्मी तो खुश हो जाएँगी !"};
    String God[]={"कामयाबी के दरवाजे उन्हीं के लिए खुलते हैं,जो उन्हें खटखटाने की ताकत रखते हैं…!!","ईश्वर पर आप तभी विश्वास कर सकते हैं,जब आपको खुद पर विश्वास हो क्योकिईश्वर बाहर नही हमारे अंदर ही हैं!!","मुझे अपने आप में कुछ यु बसा लो,के ना रहू जुदा तुमसे और खुद से तुम हो जाऊ!","मैं “किसी से” बेहतर करुं क्या फर्क पड़ता है..!मै “किसी का” बेहतर करूं बहुत फर्क पड़ता है..!!","कहने की जरूरत नही, आना ही बहुत हैं,शिव भक्ति में तेरा शीश झुकाना ही बहुत हैं!!","श्रद्धा का मतलब हैं आत्मविश्वास,और आत्मविश्वास का मतलब हैं ईश्वर में विश्वास!","भगवान बोलते है…तू करता वही है, जो तू चाहता है!पर होता वही है जो मैं चाहता हूँ,तू वही कर जो मैं चाहता हूँ,फिर होगा वही जो तू चाहता है…!","हे प्रभु! मेरी प्रार्थना को ऐसे स्वीकार करो,की जब-जब मेरा सिर झुके,मुझसे जुड़े हर इंसान की जिंदगी सँवर जाए!!","तेरा हाथ सिर पे होने सेमेरे सब काम साकार होते हैं,मैं जहाँ भी देखता हूँ तुझे मेरे मोहनमुझे तो बस तेरे दीदार होते हैं।","उसके होते हुए तू क्यों परेशान है,भगवान के चरणों में तो हर समस्या का समाधान है।"};
    String Parerna[]={"कोन जाने कब मौत का पैगाम आ जाए,\n" +
            "ज़िंदगी की आखरी शाम आ जाए,\n" +
            "हमे तो इंतजार है उस शाम का\n" +
            "जब हमारी ज़िंदगी किसी के काम आ जाए.","कर्म तेरे अच्छे हे तो\n" +
            "किस्मत तेरी दासी है!\n" +
            "\n" +
            "नियत तेरी अच्छी है तो\n" +
            "घर तेरा मथुरा कशी है","पी.एम्. की कुर्सी पे मोदी का नाम लिखूं \n" +
            "\n" +
            "अब आप ही बता दो मैं\n" +
            "इस जलती कलम से क्या लिखूं","हर नई सुबह का नया नज़ारा,\n" +
            "ठंडी हवा लेके आई पैगाम हमारा,\n" +
            "\n" +
            "जागो,उठो,तैयार हो जाओ,\n" +
            "खुशियो से भरा रहे आज का दिन तुम्हारा","उठा कर तलवार जब घोड़े पे सवार होते\n" +
            "बाँध के साफ़ा जब तैयार होते\n" +
            "देखती है दुनिया छत पे चढ़के\n" +
            "कहते है की काश हम भी ऐसे होशियार होता","हर नई सुबह का नया नज़ारा,\n" +
            "ठंडी हवा लेके आई पैगाम हमारा,\n" +
            "\n" +
            "जागो,उठो,तैयार हो जाओ,\n" +
            "खुशियो से भरा रहे आज का दिन तुम्हारा","सफ़र ज़िंदगी का बहुत ही हसीन है\n" +
            "सभी को किसी न किसी की तलाश हैं\n" +
            "किसी के पास मंज़िल हैं तो राह नही\n" +
            "और जिसके पास राह हें तो मंज़िल नही","खुद को ख़ुदा कहा और खुद ही ख़ुदा हो गए,\n" +
            "रिश्तों की कशमकश में खुद से जुदा हो गए !\n" +
            "बांचते रहे तमाम उम्र आईने में अपनी सूरत,\n" +
            "तन्हा रहे जिंदगी में और भीड़ में ही खो गए","जब टूटने लगे होसले तो बस ये याद रखना,\n" +
            "\n" +
            "बिना मेहनत के हासिल तख्तो ताज नहीं होते,\n" +
            "\n" +
            "ढूंड लेना अंधेरों में मंजिल अपनी,\n" +
            "\n" +
            "जुगनू कभी रौशनी के मोहताज नहीं होते.","“जिन्दगी में कई मुश्किलें आती है,\n" +
            "\n" +
            "और इन्सान जिन्दा रहने से घबराता हैं,\n" +
            "\n" +
            "ना जाने कैसे हजारो कांटो के बीच’\n" +
            "\n" +
            "रह कर एक फूल मुस्कुराता है.”"};
    String Life[]={"जिंदगी में बड़ी सिद्दत से\n" +
            "निभाओ अपना किरदार,\n" +
            "की पर्दा गिरने के बाद भी\n" +
            "तालिया बजती रहे। ","ज़िन्दगी में कभी किसी को कम मत\n" +
            "समझो पूरी दुनिया को डुबाने वाला\n" +
            "समंदर तेल की एक बूंद को नही डुबो सकता। ","जिंदगी वही है जो जी रहे है,\n" +
            "ये करेंगे वो करेंगे ये तो ख़्वाब है।","यह जिंदगी बस सिर्फ पल दो पल है,\n" +
            "जिसमें न तो आज और न ही कल है,\n" +
            "जी लो इस ज़िंदगी का हर पल इस तरह\n" +
            "जैसे बस यही जिंदगी का सबसे हसीं पल है।","खुशियों से नाराज़ है मेरी ज़िंदगी \n" +
            "पल दो पल की मेहमान है मेरी ज़िंदगी\n" +
            "मेरे ज़ख्मों का इलाज कुछ नहीं\n" +
            "बस मुझसे ही परेशान है मेरी ज़िंदगी। ","\"आजकल मैं ज़िंदगी के बताये रास्तों पर चल रहा हूँ I\"","\"कुछ तो आरज़ू रख, थोड़ा हौसला रख, ज़िंदगी जीने का अपना तरीका रख II\"","\"सोचता हूँ मेहनत की कलम से, ज़िंदगी की कहानी फिर से लिखूं II\"","\"जो अपने आप को सरल रखता है, वही सर्वोत्तम होता है II\"","\"आपकी पसंद ही आपकी मंज़िल तय करती है II\""};
    String Yaade[]={"कभी कभी किसी अपने की इतनी \n" +
            "याद आती है की रोने के लिए \n" +
            "रात भी कम पड़ जाती है !!","न जाने क्यों जिंदगी काँटे की तरह चुभ \n" +
            "रही है , तेरी हर एक बात अब \n" +
            "बहुत याद आ रही है !!","दिल की हालात किसी से कही नही जाती ,\n" +
            "हमसे उनकी चाहत छुपाई नही जाती ,\n" +
            "बस एक याद बची है उनके चले \n" +
            "जाने के बाद ,वो भी दिल से \n" +
            "मिटायी नही जाती !!","उम्र के राह में रास्ते बदल जाते है ,वक्त की आंधी \n" +
            "में इंसान बदल जाते है ,सोचते है तुम्हें इतना \n" +
            "याद ना करे लेकिन आँख बंद करते \n" +
            "ही इरादे बदल जाते है !!","दूर रहते है मगर दिल से दुआ करते है हम , प्यार \n" +
            "का फ़र्ज़ अदा करते है हम , आपकी याद सदा \n" +
            "साथ रखते है हम , दिन हो या रात आपको \n" +
            "ही याद करते है हम !!","दुनिया की कभी ना परवाह करना दिल से ना कभी \n" +
            "हमें जुदा करना , जब आए तुम्हें याद हमारी \n" +
            "तो बस मिलने की दुआ करना !!!","हिचकियों को मत भेजो अपना मुखबिर बना के \n" +
            "हमें और भी काम है तुम्हें याद करने \n" +
            "के सिवा  !!","मैं चाह कर भी खुद को याद नही कर पाता लेकिन ,\n" +
            "ना चाहते हुए भी तू बार -बार याद आ जाती है !!","यूं ना देख मुझे मैं कोई गैर नहीं , अरे तूने ही की \n" +
            "थी मुझसे मोहब्बत क्या तुझे याद नहीं !!","न कोई छत्रछाया है ,न कोई मोह माया है ,बारिश \n" +
            "से ज़्यादा तो मुझकों तेरी यादों ने भिगाया है !!"};
    String Other[]={"\"अल्फ़ाज़ ऐसे जो दिलों में आशियाँ बना ले, वही शायरी है।\"","\"हमे वो प्यार के नशे में धुन करते चले गए, हम उनमे गुम होते चले गए और वो हमे गुम करके चले गए।\"","\"अपने जज़्बात को अल्फ़ाज़ में तब्दील करना ही शायरी है।\"","\"शायरी लिखना उन्होंने शुरू किया, हमें तो कविताओं का शौक था। कलाकार वो खुद को कहते थे, हमे तो उनकी कलाओं का शौक था।\"","\"खुद से गुफ्तगू अक्सर शायर ही करते हैं।\"","\"वो ग़ज़ल लिखते है और हम सुनते है। वो सबपे लिखते है और हम नासमझ खुद पे समझते है।\"","\"जो लिखते है वो कवि बनते हैं, आप जो सोचते है वही बनते हैं।\"","\"कुछ खास जादू नहीं है शायरों के पास, बस बातें दिल से निकलती हैं और दिल तक पहुँचती हैं।\"","\"किसी के हाथों की कठपुतली बनने से अच्छा है, कि छोटा ही सही अपना किरदार खुद बना।\"","\"तू जो पास थी, तो तेरी कद्र जरा कम थी। मेरी गलतियों का पता कैसे चलता मुझे, तूने कभी शिकायत ही नहीं की।\""};
    String Politics[]={"सरकार को गरीबों का ख्याल कब आता है?\n" +
            "चुनाव नजदीक आ जाए तो मुद्दा उछाला जाता है.","मुर्दा लोहे को औजार बनाने वाले,\n" +
            "अपने आँसू को हथियार बनाने वाले,\n" +
            "हमको बेकार समझते हैं सियासतदां\n" +
            "मगर हम है इस मुल्क की सरकार बनाने वाले.","\n" +
            "चोर, बेईमान और भ्रष्ट नेताओं की क्यों करते हो बात,\n" +
            "लोकतंत्र की ताकत है जनता में, दिखला दो इनकी औकात.","मूल जानना बड़ा कठिन हैं नदियों का, वीरो का,\n" +
            "धनुष छोड़कर और गोत्र क्या होता हैं रणधीरो का,\n" +
            "पाते हैं सम्मान तपोबल से भूतल पर शूर,\n" +
            "“जाति-जाति” का शोर मचाते केवल कायर, क्रूर.","जहाँ सच हैं, वहाँ पर हम खड़े हैं,\n" +
            "इसी खातिर आँखों में गड़े हैं.","सरकार को गरीबों का ख्याल कब आता है?\n" +
            "चुनाव नजदीक आ जाए तो मुद्दा उछाला जाता है.","मुर्दा लोहे को औजार बनाने वाले,\n" +
            "अपने आँसू को हथियार बनाने वाले,\n" +
            "हमको बेकार समझते हैं सियासतदां\n" +
            "मगर हम है इस मुल्क की सरकार बनाने वाले.","चोर, बेईमान और भ्रष्ट नेताओं की क्यों करते हो बात,\n" +
            "लोकतंत्र की ताकत है जनता में, दिखला दो इनकी औकात.","जहाँ सच हैं, वहाँ पर हम खड़े हैं,\n" +
            "इसी खातिर आँखों में गड़े हैं.","नेता की बातों में सच्चाई का अभाव होता है,\n" +
            "झूठ बोलना तो इनका स्वभाव होता हैं."};
    String Love[]={"याद ऐसे करो की हद्द न हो,\n" +
            "भरोसा इतना करो कि शक न हो,\n" +
            "इंतज़ार इतना करो कि कोई वक़्त न हो,\n" +
            "प्यार ऐसे करो की कभी नफरत न हो…","कुछ अलग ही करना है\n" +
            "तो वफ़ा करो मेरे दोस्त,\n" +
            "मज़बूरी का नाम लेकर\n" +
            "बेवफाई तो हर कोई करता है…","काश वो मुझे सीने से लगाकर,\n" +
            "मेरी सारी शिकायत दूर कर दे…\n" +
            "मैं सिर्फ उनका हो जाऊं\n" +
            "मुझे वो इतना मजबूर कर दे…..","हकीकत कहो तो उन्हें ख्वाब लगता है,\n" +
            "शिकवा करो तो उन्हें मज़ाक लगता है,\n" +
            "कितनी शिद्दत से हम उन्हें याद करतें हैं,\n" +
            "एक वो हैं जिन्हें ये सबकुछ मजाक लगता है…","दर्द क्या होता है बताएगे किसी रोज,\n" +
            "अपने दिल की गजल सुनाएंगे किसी रोज,\n" +
            "उड़ने दो परिंदों को खुली फिजाओं में,\n" +
            "हमारे होंगे तो लौटकर आएंगे किसी रोज…","दर्द क्या होता है बताएगे किसी रोज,\n" +
            "अपने दिल की गजल सुनाएंगे किसी रोज,\n" +
            "उड़ने दो परिंदों को खुली फिजाओं में,\n" +
            "हमारे होंगे तो लौटकर आएंगे किसी रोज…","मेरी कब्र की मचान पर आईना लगा देना,\n" +
            "उसे देखने की आखरी उम्मीद बाकी हैं…","होंगी लाखों महफिलें दुनिया में,\n" +
            "मग़र तेरे दीदार जैसा सुकून कहीं और नहीं..","कोई गलती हो जाये तो डाट लिया करो,\n" +
            "मगर यू रूठा न करो हमसे..","पागल सा बच्चा हूँ,\n" +
            "मगर दिल का सच्चा हूँ,\n" +
            "थोड़ा सा आवारा हूँ,\n" +
            "मगर तेरा ही तो दीवाना हूँ.."};
    String Dard[]={"जो नजर से गुजर जाया करते हैं;\n" +
            "वो सितारे अक्सर टूट जाया करते हैं;\n" +
            "कुछ लोग दर्द को बयां नहीं होने देते,\n" +
            "बस चुपचाप बिखर जाया करते हैं।","तेरी आरज़ू मेरा ख्वाब है;\n" +
            "जिसका रास्ता बहुत खराब है;\n" +
            "मेरे ज़ख्म का अंदाज़ा न लगा;\n" +
            "दिल का हर पन्ना दर्द की किताब है।","हम उम्मीदों की दुनियां बसाते रहे;\n" +
            "वो भी पल पल हमें आजमाते रहे;\n" +
            "जब मोहब्बत में मरने का वक्त आया;\n" +
            "हम मर गए और वो मुस्कुराते रहे।","रोने की सज़ा न रुलाने की सज़ा है;\n" +
            "ये दर्द मोहब्बत को निभाने की सज़ा है;\n" +
            "हँसते हैं तो आँखों से निकल आते हैं आँसू;\n" +
            "ये उस शख्स से दिल लगाने की सज़ा है।","हादसे इंसान के संग मसखरी करने लगे;\n" +
            "लफ्ज कागज पर उतर जादूगरी करने लगे;\n" +
            "कामयाबी जिसने पाई उनके घर बस गए;\n" +
            "जिनके दिल टूटे वो आशिक शायरी करने लगे।","दिल मेरा जो अगर रोया न होता;\n" +
            "हमने भी आँखों को भिगोया न होता;\n" +
            "दो पल की हँसी में छुपा लेता ग़मों को;\n" +
            "ख़्वाब की हक़ीक़त को जो संजोया नहीं होता।","लिखूं कुछ आज यह वक़्त का तकाजा है;\n" +
            "मेरे दिल का दर्द अभी ताजा-ताजा है;\n" +
            "गिर पड़ते हैं मेरे आंसू मेरे ही कागज पर;\n" +
            "लगता है कि कलम में स्याही का दर्द ज्यादा है!","वो नाराज़ हैं हमसे कि हम कुछ लिखते नहीं;\n" +
            "कहाँ से लाएं लफ्ज़ जब हमको मिलते नहीं;\n" +
            "दर्द की ज़ुबान होती तो बता देते शायद;\n" +
            "वो ज़ख्म कैसे दिखाए जो दिखते नहीं।","खून बन कर मुनासिब नहीं दिल बहे;\n" +
            "दिल नहीं मानता कौन दिल से कहे;\n" +
            "तेरी दुनिया में आये बहुत दिन रहे;\n" +
            "सुख ये पाया कि हमने बहुत दुःख सहे।","हँसते हुए ज़ख्मों को भुलाने लगे हैं हम;\n" +
            "हर दर्द के निशान मिटाने लगे हैं हम;\n" +
            "अब और कोई ज़ुल्म सताएगा क्या भला;\n" +
            "ज़ुल्मों सितम को अब तो सताने लगे हैं हम।"};
    String Sharab[]={"तेरे जाने के बाद जीने की ख्वाइश ना थी,\n" +
            "\n" +
            "कमबख्त शराब ने हमें मरने से बचा लिया.,","तेरे साथ बिताए लम्हों को याद कर मुस्कराता हैं,\n" +
            "\n" +
            "जीने की कोई वजह नहीं फिर भी जीना चाहता हैं,\n" +
            "\n" +
            "जिस दिन हो जाए दिल बहुत ज्यादा उदास,\n" +
            "\n" +
            "इसे शराब के नशे में बहका कर खुश हो जाता हैं.,","जब आती है तेरी याद तो,\n" +
            "\n" +
            "बीती बातें याद कर फिर से जी लेता हु मैं,\n" +
            "\n" +
            "जब संभाल नहीं पता इस दिल को,\n" +
            "\n" +
            "तो महखाने में जाकर शराब पी लेता हु मै.,","एक बार टूट जाए दिल तो,\n" +
            "\n" +
            "फिर ना किसी से मोहब्बत दुबारा होती है,\n" +
            "\n" +
            "जब आए उस बेवफा की याद तो,\n" +
            "\n" +
            "फिर जीने का शराब ही सहारा होती है.,","पीता हूं जितनी उतनी ही तेरी याद आती है,\n" +
            "\n" +
            "साकी ने जैसे इश्क़ मिला दिया हो तेरा शराब में.,","रहता हूँ बहका बहका तो शराबी ना समझना,\n" +
            "\n" +
            "कभी किसी की यादें भी बहका दिया करती हैं.,","बारिश में आग लगाना चाहता है,\n" +
            "\n" +
            "वो शराब पीला कर मुझे आज़माना चाहता है.,","माना तेरे पास हुस्न है लेकिन,\n" +
            "\n" +
            "मेरे दिल के साथ ऐसे मत खेल.,","मेरे हाथों में शराब है,\n" +
            "\n" +
            "जिसके आगे तेरा हुस्न है फेल.,","हमारा दिल टूटा है हम को चाय मत पिलाओ,\n" +
            "\n" +
            "अगर दर्द मिटाना चाहते हो मेरा तो,\n" +
            "\n" +
            "पानी में मिलाकर शराब लेकर आओ.,"};
    MyAdapter adapter;

    public boolean onCreateOptionsMenu(Menu menu) {
        MenuInflater inflater = getMenuInflater();
        inflater.inflate(R.menu.menu,menu);
        return true;
    }

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);

        listView=findViewById(R.id.listView);
        adapter = new MyAdapter(MainActivity.this,imgArr,Name);
        listView.setAdapter(adapter);
        listView.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> parent, View view, int position, long id) {

                Intent intent=new Intent(MainActivity.this, Second_Activity.class);
                if (position==0)
                {
                    intent.putExtra("shayari",Shubhkamana);
                }
                else if (position==1)
                {
                    intent.putExtra("shayari",Dosti);
                }
                else if (position==2)
                {
                    intent.putExtra("shayari",Majedar);
                }
                else if (position==3)
                {
                    intent.putExtra("shayari",God);
                }
                else if (position==4)
                {
                    intent.putExtra("shayari",Parerna);
                }
                else if (position==5)
                {
                    intent.putExtra("shayari",Life);
                }
                else if (position==6)
                {
                    intent.putExtra("shayari",Yaade);
                }
                else if (position==7)
                {
                    intent.putExtra("shayari",Other);
                }
                else if (position==8)
                {
                    intent.putExtra("shayari",Politics);
                }
                else if (position==9)
                {
                    intent.putExtra("shayari",Love);
                }
                else if (position==10)
                {
                    intent.putExtra("shayari",Dard);
                }
                else if (position==11)
                {
                    intent.putExtra("shayari",Sharab);
                }
                intent.putExtra("image",imgArr[position]);
                startActivity(intent);
            }
        });

    }
}